{
    "version": "https://jsonfeed.org/version/1",
    "title": "Abhishek&#x27;s Blog",
    "description": "",
    "home_page_url": "https://abhishekchoudhary.com/blog",
    "feed_url": "https://abhishekchoudhary.com/blog/feed.json",
    "user_comment": "",
    "icon": "https://abhishekchoudhary.com/blog/media/website/output-onlinepngtools4.png",
    "author": {
        "name": "Abhishek Choudhary"
    },
    "items": [
        {
            "id": "https://abhishekchoudhary.com/blog/transcript-of-my-interview-with-pminterviewin.html",
            "url": "https://abhishekchoudhary.com/blog/transcript-of-my-interview-with-pminterviewin.html",
            "title": "Transcript of my interview with pminterview.in ",
            "summary": "The team from pminterview.in recently reached out and wanted me to answer some questions to help upcoming PMs understand the&hellip;",
            "content_html": "<p>The team from <a href=\"https://www.pminterview.in/top-product-managers\" target=\"null\">pminterview.in</a> recently reached out and wanted me to answer some questions to help upcoming PMs understand the domain better. Never one to pass up an opportunity to talk, I agreed - and here is a structured transcript (<a href=\"https://www.pminterview.in/top-product-managers/abhishek-choudhary?ref=abhishekchoudhary\">link to their post</a>).</p>\n<p>People reach out to me on LinkedIn for a peek into the Product Management life every now and then, and I figured that posting this here might be a good first breadcrumb for these young padawans (says the recently-turned-30 old timer).</p>\n<blockquote>\n<p><strong>What’s the biggest task you have worked on in your career till now?</strong></p>\n</blockquote>\n<p class=\"align-left\">At a high level, two things come to mind. My work on open-source at BrowserStack, and my initiative to revamp webpage performance at Amazon.</p>\n<p class=\"align-left\">At BrowserStack, I have a very unique responsibility as the product manager for our Open Source office – which means I create the strategy and direction of our investment in anything open-source. I get to lead iconic open-source projects like Selenium (where BrowserStack is a sponsor) and NightwatchJS (owned by BrowserStack), and help them create next-gen software testing experiences for the internet. This is “big”, because:</p>\n<ul class=\"align-left\">\n<li>The market is fascinating – a traditionally QA-oriented Java based software testing market is shifting to software developers testing everything in JavaScript. Projects like Cypress and Playwright have disrupted the space and caught traditional players like Selenium on their heels. While we are still market leaders in user share, I think it is clear to see that there is a yearning in the customer base for a better way to do things. However, I believe that the fundamentals of my products are solid, and with a mixture of customer-oriented product development and evangelism, we can really win the hearts and minds of our existing and future users.</li>\n<li>I am in a unique position where not all BrowserStack customers are my users, and not all of my users are BrowserStack customers. This creates a dichotomy where I need to be “the voice of my users”, without having a very direct line of communication with all hundreds of thousands of them! It makes a SaaS PM’s position very challenging, but equally fulfilling when we get things right. Thankfully, that happens often enough to keep me going.</li>\n</ul>\n<p class=\"align-left\">At Amazon, I was the product manager for the Detail Page (the page on which you see product details / images / reviews and add stuff to cart). One of my biggest contributions was to create a UX strategy that will work for the ‘the next billion’ – users in developing countries with access to internet, but on a poor network and low-end hardware. In a way, it is a little easy to design features when the underbelly of computing (I/O bottlenecks from a poor network, computing bottlenecks from extra-low-budget phones) is not exposed to you as the PM. Given these constraints – not just for one or two features but for the whole page and a user’s journey through Amazon, I was really made to weigh the ROI of every byte, of every CPU cycle. In the end, my team and I created crystallized the buying experience down to broad product categories, and coupled with our understanding of all sub-personas of the buyers and categories, we came up with a ‘sliding scale’ of the richness of experience. The more resources you had, the ‘richer’ your experience will be – but even the most barebones experience is completely functional. In the end, whether you’re buying the latest TV from a fibre-optic wireless connection on a Mac, or buying fertilizer for your farms in the hinterlands on a budget Android phone– you won’t feel like Amazon doesn’t care about you. ‘The Everything Store’ sells everything, so everyone should be able to buy anything.</p>\n<blockquote>\n<p><strong>What’s your advice for aspiring PMs?</strong></p>\n</blockquote>\n<p>This is very cliché, but chase your customer’s mindset. There is a concept called ‘<a href=\"https://en.wikipedia.org/wiki/Theory_of_mind\">the theory of mind</a>’ – it was a big milestone in the evolutionary journey of humans – because of which you can ‘understand other people by ascribing mental states to them (that is, surmising what is happening in their mind).’ A successful PM has their customers’ thought process down to, dare I say, a framework. More realistically, they are able to reason with themselves and others from a customer’s point of view. Know their pain, know their joys, know the why / how / when of their usage of your product. If you have multiple personas using your product, have a “average” frame of reference for all of them. A significant amount of a PM’s job is in taking a leap and going for ambitious goals, but informed leaps &gt; educated guesses &gt; toss of a coin. Obviously, this doesn’t mean that every customer ask goes on the roadmap. Sometimes you won’t give customers what they <strong><em>want</em></strong>, but you are the one who should know what they <strong><em>need</em></strong> – and they can obviously be different things. There’s a famous quote I lean on (<a href=\"https://hbr.org/2011/08/henry-ford-never-said-the-fast\">which Henry Ford probably didn’t say</a>) – “If I had asked people what they wanted, they would have said faster horses.” Know about the horse, build the car.</p>\n<blockquote>\n<p><strong>What do you cherish the most as a PM?</strong></p>\n</blockquote>\n<p>Impact – both short and long term. Additionally, the expertise with which you’re able to understand the market and the customer. In no other role do you become an expert in the business domain to the extent you do in Product Management.</p>\n<blockquote>\n<p><strong>What are your core skills as a PM?</strong></p>\n</blockquote>\n<p>If I had to pick the most important the seven most important skills for a PM, they would be:</p>\n<ul>\n<li>Customer empathy – know your user and the problem to solve</li>\n<li>Creativity – the solutions aren’t always straightforward</li>\n<li>Communication – no one else knows what’s in your head</li>\n<li>Prioritization – every single problem can’t be solved, and not everything should be done right now</li>\n<li>Writing – your head is not large enough to hold all your thoughts</li>\n<li>Big picture thinking – all the bricks should make a wall, otherwise you’ve just scattered bricks all over the field and no one likes that</li>\n<li>Patience – everything takes time</li>\n</ul>\n<p>I’d say that my experience has drilled most of them in me, but I am still prone to bouts of impatience every now and then. Oh well, we all have our areas of growth.</p>\n<p>In my previous life as a software engineer, my background was in analytics as well as high-scale infrastructure. Some things that have transferred really well from there, and give me an edge over others who probably haven’t travelled the same road:</p>\n<ul>\n<li>System design</li>\n<li>Data analysis</li>\n<li>Formal logic</li>\n<li>Hypothesis testing</li>\n<li>Difference between POC and scaling</li>\n</ul>\n<blockquote>\n<p><strong>Any recommendation for books / blog / newsletter ?</strong></p>\n</blockquote>\n<p>My top 5 books for any product manager are always these 5:</p>\n<ul>\n<li><a href=\"https://www.goodreads.com/en/book/show/40535691-the-right-it\">The Right It</a> – what to build</li>\n<li><a href=\"https://www.goodreads.com/book/show/52283963-the-mom-test\">The Mom Test</a> – how to talk to customers</li>\n<li><a href=\"https://www.goodreads.com/book/show/2615.The_Innovator_s_Dilemma\">The Innovator’s Dilemma</a> – how to think big</li>\n<li><a href=\"https://www.goodreads.com/book/show/38398157-blitzscaling\">Blitzscaling</a> – how to scale</li>\n<li><a href=\"https://www.goodreads.com/book/show/64582.Chaos\">Chaos</a> – how to identify when old mental models are misleading you</li>\n</ul>\n<p>Instead of blogs and newsletters, I would recommend communities (who can, in turn, pick out the best content for you!):</p>\n<ul>\n<li><a href=\"https://news.ycombinator.com/\">Hacker News</a> – Y Combinator’s tech news and discussion portal</li>\n<li><a href=\"https://www.reddit.com/r/ProductManagement/\">r/ProductManagement</a> – A sub-reddit for PMs of all domains and levels</li>\n</ul>",
            "image": "https://abhishekchoudhary.com/blog/media/posts/15/matt-botsford-OKLqGsCT8qs-unsplash.jpg",
            "author": {
                "name": "Abhishek Choudhary"
            },
            "tags": [
                   "Product Management",
                   "Interview",
                   "Career",
                   "Book recommendations",
                   "Advice"
            ],
            "date_published": "2022-02-21T21:32:32+05:30",
            "date_modified": "2022-02-21T21:40:19+05:30"
        },
        {
            "id": "https://abhishekchoudhary.com/blog/new-favourite-quote.html",
            "url": "https://abhishekchoudhary.com/blog/new-favourite-quote.html",
            "title": "New favourite quote",
            "summary": "I think it's important to understand that you're not doing it for a gold medal. Regardless of which life you&hellip;",
            "content_html": "<p><code>I think it's important to understand that you're not doing it for a gold medal. Regardless of which life you chose to live, you will sacrifice something, that's the way it is.</code></p>\n<p><code>As soon as you go in one direction, you also choose to not go in all other directions at the same time. It's the basic precondition for going anywhere at all.</code></p>\n<p><code>But on the path you take, you will experience fantastic things, even though it's uphill there will be a great view when you're at the top, and that's what makes it worth it, to be on this journey with people you love. It doesn't matter that much where the journey ends. A movie with a sad ending is also a good movie - and a movie with a nice ending makes you happy.</code></p>\n<p><code>I'm very happy for this medal around my neck, and for getting all the way here. But why do you do it? I don't think you get to pick your dreams, they pick us. It's up to us to realize them or not, and it seems like people who try to realize their dreams are happier.</code></p>\n<p><a href=\"https://twitter.com/Radiosporten/status/1491090244652969984\">Original source</a>, <a href=\"https://news.ycombinator.com/item?id=30329660\">translation</a>.</p>\n<p> </p>",
            "image": "https://abhishekchoudhary.com/blog/media/posts/14/GettyImages-1370141663_494955_yhat56.jpg",
            "author": {
                "name": "Abhishek Choudhary"
            },
            "tags": [
                   "Success",
                   "Olympics",
                   "Nils van der Poel",
                   "Life",
                   "Gold medal",
                   "Dreams",
                   "Decisions",
                   "Beijing"
            ],
            "date_published": "2022-02-21T09:32:28+05:30",
            "date_modified": "2022-02-21T14:50:20+05:30"
        },
        {
            "id": "https://abhishekchoudhary.com/blog/druk-driving.html",
            "url": "https://abhishekchoudhary.com/blog/druk-driving.html",
            "title": "Druk driving",
            "summary": "Summary in 5 seconds: attended a wedding in Kolkata, drove into Bhutan in December, battled rain / snow / mud&hellip;",
            "content_html": "<p class=\"msg msg--highlight \"><em><strong>Summary in 5 seconds</strong>: attended a wedding in Kolkata, drove into Bhutan in December, battled rain / snow / mud but had a good time because Zumzin is literally nectar and Bhutan is the most relaxed place I've ever seen.</em></p>\n<p>\"You know, if it's snowing on top of the mountains, there will be rain on the foothills. I don't know why you're surprised.\" The very non-chalant monk made complete sense.</p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://abhishekchoudhary.com/blog/media/posts/9/IMG_5540.jpeg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://abhishekchoudhary.com/blog/media/posts/9/responsive/IMG_5540-xs.jpeg 300w ,https://abhishekchoudhary.com/blog/media/posts/9/responsive/IMG_5540-sm.jpeg 480w ,https://abhishekchoudhary.com/blog/media/posts/9/responsive/IMG_5540-md.jpeg 768w\"  alt=\"\" width=\"375\" height=\"667\"></figure>\n<p>In hindsight, this was one of my more pedestrian realizations. I couldn't believe I didn't think of this while posting Paro's very snowy weather forecast on my Instagram the night before. Anyhow, now that I was sitting next to a fire, observing a thunderstorm and no longer actively experiencing it, I waited for the sensation in my hands to return and felt I should be kinder on myself (and in the process, burning my gloves at the stove).</p>\n<p>A plan in the making for more than 2 years, my trip to Bhutan finally materialized in the December of 2018. A friend decided to get married in Kolkata and I felt it would be almost stupid to not do Bhutan on Kolkata's piggyback, geographically speaking - even though this is bang in the middle of winter on very deserted roads through the heart of the Himalayas. Right? <em>Right?</em>. In the end, it's about convincing youself that, let's say, <em>questionable</em> ideas are only, umm, <em>questionable</em>, for other people.</p>\n<p>Arriving in Kolkata on a Friday night, it was go time (for a lot of people, apparently - Kolkata is by <em>far</em> the noisiest airport I've been on). I decided to immerse myself in the ex-capital over the weekend, and took a look about.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/415A68AB-41D9-452B-ACCF-DB1686FEB3C9.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/415A68AB-41D9-452B-ACCF-DB1686FEB3C9-thumbnail.jpeg\" alt=\"Salt Lake Stadium\" width=\"768\" height=\"576\"></a>\n<figcaption>The immaculate Salt Lake Stadium</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/D5CC0363-E668-4EB0-B79D-F6A0A6065C7E.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/D5CC0363-E668-4EB0-B79D-F6A0A6065C7E-thumbnail.jpeg\" alt=\"The Victoria Memorial\" width=\"768\" height=\"576\"></a>\n<figcaption>Victoria Memorial: a beautiful shrine to a not-that-beautiful time in India</figcaption>\n</figure>\n</div></div>\n<p>Amidst all the beauty of the Victoria Momorial and the grandeur of the Salt Lake Stadium (which we somehow both casually walked into and, according to the security guy, maliciously broke into) - a couple of small things stand out. Or should I say hundred thousand small things - the electrical wires which are a few dozen cables away from blocking the sky. That, and the open advertisments of liquor - I kind of see where the ban comes from, but also - Glenlivet Books - you're not fooling anyone.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5491.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5491-thumbnail.jpeg\" alt=\"The unmatched power cable meshes of Kolkata\" width=\"768\" height=\"576\"></a>\n<figcaption>The unmatched power cable meshes of Kolkata</figcaption>\n</figure>\n</div></div>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5507-1.jpeg\" data-size=\"1932x2576\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5507-1-thumbnail.jpeg\" alt=\"Kolkata trip partner and airport navigation expert Sanjeed\" width=\"768\" height=\"1024\"></a>\n<figcaption>Kolkata trip partner and airport navigation expert Sanjeed</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5508.jpeg\" data-size=\"3024x4032\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5508-thumbnail.jpeg\" alt=\"Most VFM cocktails ever\" width=\"768\" height=\"1024\"></a>\n<figcaption>Most VFM cocktails ever</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5492.jpeg\" data-size=\"3024x4032\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5492-thumbnail.jpeg\" alt=\"The honourable Captain Morgan\" width=\"768\" height=\"1024\"></a>\n<figcaption>The honourable Captain Morgan</figcaption>\n</figure>\n</div></div>\n<p>After making sure that Sameer and Pragya did indeed get married, I braced for the adventure leg of the trip. A bike was waiting for me in a garage in Siliguri, and I was supposed to ride it across a real international border. A friend I made on the Bagdogra flight dropped me to Siliguri in my quota of random strangers' kindness for the day (thanks Betty, I'll try to pay it forward). As for my ride, I picked a beautiful white <a href=\"https://www.royalenfield.com/in/en/home/motorcycles/himalayan/\" target=\"_blank\" rel=\"noopener noreferrer\">Himalayan</a>. Amit at <a href=\"https://www.darjeelingriders.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Darjeeling Riders</a> was very, very helpful throughout the process, and the bike was as good as was promised. I filled out the paperwork, and away we went...</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5520.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5520-thumbnail.jpeg\" alt=\"Bike in garage\" width=\"768\" height=\"576\"></a>\n<figcaption>Bike in garage</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5521.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5521-thumbnail.jpeg\" alt=\"Bike not in garage\" width=\"768\" height=\"576\"></a>\n<figcaption>Bike not in garage</figcaption>\n</figure>\n</div></div>\n<p>... at 3 pm on December 16. 4 hours from the border, in the middle of winter. When the sun sets before the clock strikes 6. And I was hoping to celebrate Bhutan's National Day (December 17) <strong>in</strong> Bhutan, with the Bhutanese people. C- for planning and estimation right there. However, what sets your true blind spots apart is the fact that you don't know that you can't see them until they smack you in the face.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"1\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5527.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5527-thumbnail.jpeg\" alt=\"New hutanese friend travelling in India as I was going to Bhutan\" width=\"768\" height=\"576\"></a>\n<figcaption>New bhutanese friend travelling in India as I was going to Bhutan</figcaption>\n</figure>\n</div></div>\n<p>Every person I consulted for the trip, I asked \"is the Bhutanese border open on National day?\" - and they all told me it was. What I <strong>should</strong> have been asking was \"do they issue new permits on National day?\" - to which anyone in the know would have said \"no, they don't because it's a national holiday\". For those who can't see where this is going - when I reached Jaigaon at 8 pm and scrambled to see if I can just cross over immediately, I was met with equal parts laughter and surprise from the Indian and Bhutanese border patrol agents. Well, at least they seemed to be good friends, which was nice.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5531.jpeg\" data-size=\"2968x3958\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5531-thumbnail.jpeg\" alt=\"The border is... clear\" width=\"768\" height=\"1024\"></a>\n<figcaption>The border is... clear</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5533.jpeg\" data-size=\"3024x4032\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5533-thumbnail.jpeg\" alt=\"Some peaceful border backdoors\" width=\"768\" height=\"1024\"></a>\n<figcaption>Some peaceful border backdoors</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5534.jpeg\" data-size=\"3024x4032\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5534-thumbnail.jpeg\" alt=\"Foreshadowing\" width=\"768\" height=\"1024\"></a>\n<figcaption>Foreshadowing</figcaption>\n</figure>\n</div></div>\n<p>So while the <a href=\"https://en.wikipedia.org/wiki/Gross_National_Happiness\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://en.wikipedia.org/wiki/Gross_National_Happiness&amp;source=gmail&amp;ust=1641051650886000&amp;usg=AOvVaw0DrbLslguq_j0m14XslEQt\" rel=\"noopener\">happiest country in the world</a> cheered on for its 111<sup>th</sup> national day, I worked on setting mundanities like getting a SIM card in order (<a href=\"https://www.tashicell.com/\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.tashicell.com/&amp;source=gmail&amp;ust=1641051650886000&amp;usg=AOvVaw3DXvMt5ktALA9VstdgNAp_\" rel=\"noopener\">TashiCell</a>, absolutely brilliant service and coverage). Raring to go, I planned to be the first in line at the immigration desk the next morning. Which I did - at 8 am - but it was raining so I let braver souls take my spot while I sought shade and tried to bring myself to terms with my new position in the queue - about 10<sup>th</sup>. Unbeknownst to me, this would become a real problem when I misunderstand the permit process and head straight to the final verification clerk on the desk. Miffed, he asked me to go the gentleman seated 3 feet to his right, to whom I now seemed to be coming from 'the wrong side' and therefore cutting in line. For reasons I can't understand, he threw me to the back of the line and threatened to have anyone 'taking my side' follow me - this wasn't the happy gentry I was promised. I finally got my permit at noon. The permit for the bike took another 2 hours, and I finally departed Phuentsholing for Paro at 2:30 pm. The Bhutanese police stop every vehicle just before the highway and say - \"don't honk, this is not India\".</p>\n<p>It's amazing what the lush Himalayan countryside does to your temper. I went from 'pissed' to 'ecstatic' in about 5 minutes. In another 25, I went from 'ecstatic' to 'concerned' when the light rain turned to a rainstorm. With the dropping temperatures and my progressively numbing extremities (multiplied by the fact that my riding gloves weren't waterproof), I decided at 4:30 pm that I will stop and seek help at the next sign of humanity. If there was one thing Ladakh taught me, it was to not challenge nature. So I still do it, but in moderation. In another 30 minutes I saw some people sitting by a fire in a cabin over a valley. I parked the bike, stumbled into the cabin, and basically crumbled by the fire. It is hard to put in words the warmth that I received from both the fire and the people. We were a few kilometres from Gedu, and as it turns out, it was the last town before the new 'mega-highway' takes you directly to Paro in another 3 hours with no notable towns or villages along the way. I met a group of bikers returning to India from Paro - under significant duress due to this rain and the snowstorm that they started with - who congratulated me for making it this far and begged me to not go any further that day. The local people, on the other hand, egged me on. \"We go there all the time.\" \"In this weather?\" \"Yes.\" \"After sunset?\" \"Yes.\" \"On a 2-wheeler?\" \"No, but you will be fine.\" The weather gods also tempted me with some literal rays of sunshine which lasted for about 10 minutes, but by the time I finished eating, the storm had surrounded us again. In one of my rarer decisions, I said no to this adventure and planned to sleep in - in what was apparently the last available room in the town's local guest house. With nothing to do, I threw my stuff in the room and headed back to the cabin to spend time with these new friends. There, I came across another Indian couple (from Bangalore, no less) who were heading to Paro. I talked to them the sense that my experiences had hammered into me, and since there was no space left in the town to sleep anymore, I invited Lalith and his wife to sleep in my room.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5541.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5541-thumbnail.jpeg\" alt=\"Deceptive rays of hope in the storm\" width=\"768\" height=\"576\"></a>\n<figcaption>Deceptive rays of hope in the storm</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5543.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5543-thumbnail.jpeg\" alt=\"Honest rays of hope in the morning\" width=\"768\" height=\"576\"></a>\n<figcaption>Honest rays of hope in the morning</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5544.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5544-thumbnail.jpeg\" alt=\"The holy shelter\" width=\"768\" height=\"576\"></a>\n<figcaption>The holy shelter</figcaption>\n</figure>\n</div></div>\n<p>The next morning was as different from the last was as it could have been - at 7 am, it was all still very cold, but not a cloud in sight. We started in pursuit of a breakfast joint, and we found one run by the Indian army. The jawans told us that at least 3 people died trying to drive through the storm last night - and I had no trouble believing him given the number of skid marks and abandoned-after-accident trucks and cars I saw on the road that day. I bid my new friends goodbye and headed, finally, to Paro. <a href=\"https://www.booking.com/hotel/bt/ama-39-s-farmstay.html\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.booking.com/hotel/bt/ama-39-s-farmstay.html&amp;source=gmail&amp;ust=1641051650886000&amp;usg=AOvVaw0FMiAeFFoqInmRB73wdn8P\" rel=\"noopener\">Ama's Village Lodge</a> had already waited an extra day to see me. A thankfully event-free drive led me to the place, and I thankfully found two of the most warm-hearted people I've met - Ama and her brother Karma (and Snowy, the very vocal but deceptively friendly dog). With way less than expected time at hand for Paro, I raked their brains for the best things to do - which are apparently the <a href=\"https://www.lonelyplanet.com/bhutan/paro/attractions/paro-dzong/a/poi-sig/449123/355843\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.lonelyplanet.com/bhutan/paro/attractions/paro-dzong/a/poi-sig/449123/355843&amp;source=gmail&amp;ust=1641051650886000&amp;usg=AOvVaw1ulJIzCuHWJgPjjOZ0Nz6M\" rel=\"noopener\">Rinpung Dzong</a> and the <a href=\"https://www.lonelyplanet.com/bhutan/paro/attractions/pena-lhakhang/a/poi-sig/1371116/355843\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.lonelyplanet.com/bhutan/paro/attractions/pena-lhakhang/a/poi-sig/1371116/355843&amp;source=gmail&amp;ust=1641051650886000&amp;usg=AOvVaw2nzXgPItdLmOy8imP1M0kJ\" rel=\"noopener\">Pena Lakhang</a>. Both exquisitely beautiful, as expected.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/IMG_5553.jpeg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://abhishekchoudhary.com/blog/media/posts/9/responsive/IMG_5553-xs.jpeg 300w ,https://abhishekchoudhary.com/blog/media/posts/9/responsive/IMG_5553-sm.jpeg 480w ,https://abhishekchoudhary.com/blog/media/posts/9/responsive/IMG_5553-md.jpeg 768w\"  alt=\"Ridiculously photogenic bike and bag\" width=\"300\" height=\"400\">\n<figcaption >Ridiculously photogenic bike and bag</figcaption>\n</figure>\n<p>At Pena Lakhang is where I made two very unexpected, but nonetheless delightful, friends. During my tour, two kids gingerly approached me, and asked me where I'm from. A couple of exchanges later, they declared that they had accepted me in their best friend group. And this was before I even told them that I was there in a bike - which made them absolutely lose it, run out to the parking area, and climb on the Himalayan. \"Sell this to me. How much?\" \"2 lakh rupees.\" (looking at his friend) \"I don't think mother will give me so much money\". It was getting dark, and the adult in me did want to hand my new friends over to other adults, so we set about finding their family. This was an unexpectedly emotional goodbye.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5607-1.jpeg\" data-size=\"2710x3614\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5607-1-thumbnail.jpeg\" alt=\"Pena Lakhang\" width=\"768\" height=\"1024\"></a>\n<figcaption>Pena Lakhang</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5612.jpeg\" data-size=\"1932x2576\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5612-thumbnail.jpeg\" alt=\"New friends and casual bike enthusiasts\" width=\"768\" height=\"1024\"></a>\n<figcaption>New friends and casual bike enthusiasts</figcaption>\n</figure>\n</div></div>\n<p>The next day, I had to climb that-monastery-by-the-side-of-<wbr>a-mountain / the unofficial symbol of Bhutan / the Tiger's Nest Monastery. I was staying almost in the mountain's shadow, so I was about 3 kms from the parking point. In my infinite wisdom, I took off without my protective gear. A rash (Indian) car overtook me, and I shrugged it off - I just wanted to let the second car pass me by too. You never want to be between two cars as a biker in the mountains. That's when a sudden slope appeared, the car in front of me lost balance, and so did I. Given the laws of physics, though, cars are difficult to tumble after low-speed mistakes but bikes have it especially easy. So I did, and waited on my back in the middle of the road for the second car to run me over at 15 km/h. Thankfully, this guy was a better driver than the rest of us, and he stopped his vehicle and stepped out to help me. Bless his soul. A hiking stick fashioned out of a tree branch helped me navigate the mountain as if nothing happened, and I ended up climbing the Tiger's Nest. The climb up was actually easier for my hurt knee than the descent, but meeting people like Ibrahim (and his son), who entertained me with stories of their other adventures helped me recharge every few hundred metres. Finally, I got back to Ama's loaded my things on the bike, and prepared for my departure to Thimphu. </p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5642.jpeg\" data-size=\"1932x2576\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5642-thumbnail.jpeg\" alt=\"My trusty walking stick\" width=\"768\" height=\"1024\"></a>\n<figcaption>My trusty walking stick</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5700.jpeg\" data-size=\"3024x4032\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5700-thumbnail.jpeg\" alt=\"Jack the backpack\" width=\"768\" height=\"1024\"></a>\n<figcaption>Jack the backpack</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5720.jpeg\" data-size=\"2225x2967\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5720-thumbnail.jpeg\" alt=\"Watching the watch\" width=\"768\" height=\"1024\"></a>\n<figcaption>Watching the watch</figcaption>\n</figure>\n</div></div>\n<p>A chase by a few rather muscular street dogs aside, the late-evening ride into <a href=\"https://www.airbnb.com/rooms/25815280\" target=\"_blank\" data-saferedirecturl=\"https://www.google.com/url?q=https://www.airbnb.com/rooms/25815280&amp;source=gmail&amp;ust=1641051650886000&amp;usg=AOvVaw0XjCJl_b2rcdIzZJGytmZh\" rel=\"noopener\">Little Village</a> was quiet. Exhausted after a long day, I had some food and proceeded to collapse directly at the sight of a bed. I decided to stay collapsed for the next day, effectively abandoning the idea of exploring Thimphu. A 'vacation from a vacation', so to speak. The cottage had a far-away view of the famous Buddha statue, and I guess that was good enough for me. I chatted with the family all day, who told me that they had bears and boars roaming in the exact spot where I stood before they put the fencing up a few months ago, because 'technically' this was all still a jungle. Ah, the comfort of knowing that I will probably not be mauled to death inside the farm (but could have been while driving up to it yesterday, or could be while leaving it tomorrow).</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5731-2.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5731-2-thumbnail.jpeg\" alt=\"Vacation with a view\" width=\"768\" height=\"576\"></a>\n<figcaption>Vacation with a view</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5733-2.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5733-2-thumbnail.jpeg\" alt=\"Vacation with more view\" width=\"768\" height=\"576\"></a>\n<figcaption>Vacation with more view</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5738-2.jpeg\" data-size=\"4032x3024\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5738-2-thumbnail.jpeg\" alt=\"Picturesque entrance to the house\" width=\"768\" height=\"576\"></a>\n<figcaption>Picturesque entrance to the house</figcaption>\n</figure>\n</div></div>\n<p>Fascinating talks went on for the entire day, interspersed with reading sessions in truly pin-drop silence, before I turned in again and prepared to leave this wonderful land. Another stay at Barsana followed, and I promptly left the morning after for my return flight from Bagdogra to Bangalore.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"2\">\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5749.jpeg\" data-size=\"1932x2576\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5749-thumbnail.jpeg\" alt=\"Fantastic hosts in Thimphu\" width=\"768\" height=\"1024\"></a>\n<figcaption>Fantastic hosts in Thimphu</figcaption>\n</figure>\n<figure class=\"gallery__item\"><a href=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5765.jpeg\" data-size=\"3024x4032\"><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/gallery/IMG_5765-thumbnail.jpeg\" alt=\"Too tired to stand next to the bike on the way back\" width=\"768\" height=\"1024\"></a>\n<figcaption>Too tired to stand next to the bike on the way back</figcaption>\n</figure>\n</div></div>\n<p>In the end, what I remember is the most warm-hearted, intelligent, and driven people I've met. The level of education in Bhutan is commendable, and the way most people went out of their way to make my stay pleasant will stay with me forever. I'm sure this and future generations of Bhutanese people will take the country very far.</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/IMG_5778.jpeg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://abhishekchoudhary.com/blog/media/posts/9/responsive/IMG_5778-xs.jpeg 300w ,https://abhishekchoudhary.com/blog/media/posts/9/responsive/IMG_5778-sm.jpeg 480w ,https://abhishekchoudhary.com/blog/media/posts/9/responsive/IMG_5778-md.jpeg 768w\"  alt=\"Signing off!\" width=\"600\" height=\"450\">\n<figcaption >Signing off!</figcaption>\n</figure>\n<p><strong>Side note:</strong> The Bhutanese are very, let's say, <em>liberal</em> with their alcohol. It's sold in grocery stores in the most remote places. And some absolutely fantastic alcohol too - not your run of the mill drink-to-get-drunk stuff. Zumzin!</p>\n<figure class=\"post__image post__image--center\" ><img loading=\"lazy\" src=\"https://abhishekchoudhary.com/blog/media/posts/9/zumzin-750-ml.jpg\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://abhishekchoudhary.com/blog/media/posts/9/responsive/zumzin-750-ml-xs.jpg 300w ,https://abhishekchoudhary.com/blog/media/posts/9/responsive/zumzin-750-ml-sm.jpg 480w ,https://abhishekchoudhary.com/blog/media/posts/9/responsive/zumzin-750-ml-md.jpg 768w\"  alt=\"Bonus picture: Zumzin!\" width=\"600\" height=\"754\">\n<figcaption >Zumzin!</figcaption>\n</figure>\n<p> </p>",
            "image": "https://abhishekchoudhary.com/blog/media/posts/9/IMG_5521.jpeg",
            "author": {
                "name": "Abhishek Choudhary"
            },
            "tags": [
                   "Travelogue",
                   "Thimphu",
                   "Solo travel",
                   "Royal Enfield",
                   "Paro",
                   "Kolkata",
                   "India",
                   "Himalayas",
                   "Himalayan",
                   "Calcutta",
                   "Biking",
                   "Bhutan",
                   "Bengal",
                   "Adventure"
            ],
            "date_published": "2021-12-31T22:39:57+05:30",
            "date_modified": "2022-02-21T22:10:09+05:30"
        }
    ]
}
